docs: revamp mkdocs site, diagrams, math, pages
